// 3. Хэрэв гараас оруулсан username нь 'admin' байвал 'Hello, Admin!', өөр username байх тохиолдолд 'Hello, ...!' цэгийн оронд тухайн хэрэглэгчийн username-г харуул.

let username = "admin";



// 4. Гараас оруулсан password зөвхөн 'password123' байх үед хэрэглэгч амжилттай нэвтрэх бөгөөд нэвтэрсэн тохиолдолд 'Access granted!' гэж харуул. Хэрэв password алдаатай бол 'Enter the password:' гэсэн текстийг дахин харуул.
// 5. 'Hello World' гэсэн текстийг 5 удаа хэвлэ.

let text = "Hello World";
let i = 0;
while (i < 5) {
    text = text + 1;
    i++;
} console.log(text);


// 6. 1-20 хүртэл тоог хэвлэж харуул.

////////////////////////////////

// 1.  1-20 хүртэл тооны нийлбэрийг ол.

// 2.  password нь 'pass1234' байх бөгөөд буруу хийх 3 удаагийн боломж л байна. Зөв байх тохиолдолд 'Access granted!' гэж харагдах бол буруу оруулсан тохиолдолд 'Enter your password: ' гэж гарч ирнэ. Харин 3 удаа буруу оруулсан тохиолдолд 'Access denied!' гэж харагдана.

// 3. Fibonacci sequence эхний 10 тоог хэвлэ. 

